       file-control.
      *  Se utiliza para guardar la información en general.
         select ventas assign to disk
           organization is indexed
           access is dynamic
           record key codigo_venta.