       01 obten_codigo_agente
           BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT.
           02 line 4 col 5 value "Introduce el codigo de la agente: "  .
           02 line 4 col 38 REQUIRED pic xx using aux_agente.