       01 obten_codigo_venta
           BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT.
           02 line 4 col 5 value "Introduce el codigo de la venta: "  .
           02 line 4 col 37 REQUIRED pic xxxx using codigo_venta.