       01 p_confi_eliminar
           BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT.
           02 line 20 col 25 value 
           "Esta seguro que quiere eliminar la venta? S/N: ".
           02 line 20 col 73 REQUIRED pic x using continuar.