      *Dibuja los marcos de todas las pantallas.
       01 PantallaMarco BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT.
           02 BLANK SCREEN.
           02 Line 1.
               03 COL 1 value "*".
               03 pic x(79) value all "*".
           02 Line 25.
               03 COL 1 value "*".
               03 pic x(78) value all "*".        
